; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image0 - mode
	spectrograph7 - mode
	infrared2 - mode
	image9 - mode
	thermograph8 - mode
	spectrograph1 - mode
	thermograph5 - mode
	image6 - mode
	spectrograph3 - mode
	infrared4 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	Star5 - direction
	Star6 - direction
	Star4 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph7)
	(supports instrument0 thermograph5)
	(supports instrument0 thermograph8)
	(supports instrument0 image6)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared4)
	(supports instrument1 infrared2)
	(supports instrument1 thermograph8)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph1)
	(supports instrument2 image9)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
)
(:goal (and
	(have_image Star7 image9)
	(have_image Planet8 thermograph5)
	(have_image Phenomenon9 image6)
	(have_image Phenomenon9 infrared2)
	(have_image Phenomenon10 image0)
	(have_image Phenomenon10 spectrograph1)
	(have_image Phenomenon10 spectrograph3)
	(have_image Planet11 thermograph5)
	(have_image Star12 infrared2)
	(have_image Star12 image9)
))

)

; plan
1. (turn_to satellite0 groundstation0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 10
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (turn_to satellite0 star12 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star12)
   goals met: 0 of 10
5. (take_image satellite0 star12 instrument1 infrared2)
   added: (have_image star12 infrared2)
   goals met: 1 of 10
6. (turn_to satellite0 phenomenon9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 10
7. (take_image satellite0 phenomenon9 instrument1 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 10
9. (take_image satellite0 phenomenon10 instrument1 spectrograph3)
   added: (have_image phenomenon10 spectrograph3)
   goals met: 3 of 10
10. (turn_to satellite0 star4 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star4)
   goals met: 3 of 10
11. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 10
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 10
13. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 3 of 10
14. (turn_to satellite0 phenomenon9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 10
15. (take_image satellite0 phenomenon9 instrument0 image6)
   added: (have_image phenomenon9 image6)
   goals met: 4 of 10
16. (turn_to satellite0 planet11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet11)
   goals met: 4 of 10
17. (take_image satellite0 planet11 instrument0 thermograph5)
   added: (have_image planet11 thermograph5)
   goals met: 5 of 10
18. (turn_to satellite0 planet8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet8)
   goals met: 5 of 10
19. (take_image satellite0 planet8 instrument0 thermograph5)
   added: (have_image planet8 thermograph5)
   goals met: 6 of 10
20. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 6 of 10
21. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 6 of 10
22. (turn_to satellite0 groundstation2 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation2)
   goals met: 6 of 10
23. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 6 of 10
24. (turn_to satellite0 phenomenon10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon10)
   goals met: 6 of 10
25. (take_image satellite0 phenomenon10 instrument2 image0)
   added: (have_image phenomenon10 image0)
   goals met: 7 of 10
26. (take_image satellite0 phenomenon10 instrument2 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 8 of 10
27. (turn_to satellite0 star12 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star12)
   goals met: 8 of 10
28. (take_image satellite0 star12 instrument2 image9)
   added: (have_image star12 image9)
   goals met: 9 of 10
29. (turn_to satellite0 star7 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star7)
   goals met: 9 of 10
30. (take_image satellite0 star7 instrument2 image9)
   added: (have_image star7 image9)
   goals met: 10 of 10
